import tkinter as tk

letters_dict_1 = {'а': 'f', 'б': ',', 'в': 'd', 'г': 'u', 'д': 'l', 'е': 't', 'ё': '`', 'ж': ';',
                'з': 'p', 'и': 'b', 'й': 'q', 'к': 'r', 'л': 'k', 'м': 'v', 'н': 'y',
                'о': 'j', 'п': 'g', 'р': 'h', 'с': 'c', 'т': 'n', 'у': 'e', 'ф': 'a',
                'х': '[', 'ц': 'w', 'ч': 'x', 'ш': 'i', 'щ': 'o', 'ь': 'm', 'ы': 's',
                'ъ': ']', 'э': "'", 'ю': '.', 'я': 'z', 'А': 'F', 'Б': '<', 'В': 'D',
                'Г': 'U', 'Д': 'L', 'Е': 'T', 'Ё': '~', 'Ж': ':', 'З': 'P', 'И': 'B', 'Й': 'Q',
                'К': 'R', 'Л': 'K', 'М': 'V', 'Н': 'Y', 'О': 'J', 'П': 'G', 'Р': 'H',
                'С': 'C', 'Т': 'N', 'У': 'E', 'Ф': 'A', 'Х': '{', 'Ц': 'W', 'Ч': 'X',
                'Ш': 'I', 'Щ': 'O', 'Ь': 'M', 'Ы': 'S', 'Ъ': '}', 'Э': '"', 'Ю': '>', 'Я': 'Z'}

letters_dict_2 = {'а': 'f', 'б': ',', 'в': 'd', 'г': 'u', 'д': 'l', 'е': 't', 'ё': '`', 'ж': ';',
                'з': 'p', 'и': 'b', 'й': 'q', 'к': 'r', 'л': 'k', 'м': 'v', 'н': 'y',
                'о': 'j', 'п': 'g', 'р': 'h', 'с': 'c', 'т': 'n', 'у': 'e', 'ф': 'a',
                'х': '[', 'ц': 'w', 'ч': 'x', 'ш': 'i', 'щ': 'o', 'ь': 'm', 'ы': 's',
                'ъ': ']', 'э': "'", 'ю': '.', 'я': 'z', 'А': 'F', 'Б': ',', 'В': 'D',
                'Г': 'U', 'Д': 'L', 'Е': 'T', 'Ё': '`', 'Ж': ';', 'З': 'P', 'И': 'B', 'Й': 'Q',
                'К': 'R', 'Л': 'K', 'М': 'V', 'Н': 'Y', 'О': 'J', 'П': 'G', 'Р': 'H',
                'С': 'C', 'Т': 'N', 'У': 'E', 'Ф': 'A', 'Х': '[', 'Ц': 'W', 'Ч': 'X',
                'Ш': 'I', 'Щ': 'O', 'Ь': 'M', 'Ы': 'S', 'Ъ': ']', 'Э': "'", 'Ю': '.', 'Я': 'Z'}

C = '#c7bcf3'

class Translater:
    def __init__(self):
        pass





if __name__=='__main__':
    root = tk.Tk()
    root.title('Транскрипция на Английскую роскладку')
    image = tk.PhotoImage(file='icon_11.png')
    root.iconphoto(True, image)
    t = Translater(root)
    root.mainloop()